""" NUMPY """
# 선형대수 연산에 필요한 디자인 배열과 배열 연산을 수행하는 다양한 함수 제공

#---------------------------------------------------------------------------------------

import numpy as np

# 1. 넘파이 배열
# 파이썬의 list와 비슷해 보이지만 계산 속도가 훨씬 빠르다

""" 1차원 """
a_values = np.array([12500, 45000, 32000, 0, 56000])
print(a_values) # [12500 45000 32000     0 56000]

""" 2차원 """
b_values = np.array([
    [1000, 2000, 3000, 4000],
    [5000, 6000, 7000, 8000],
    [9000, 10000, 11000, 12000],
])
print(b_values) # [[ 1000  2000  3000  4000]
                #  [ 5000  6000  7000  8000]
                #  [ 9000 10000 11000 12000]]

""" 3차원 """
c_values = np.array([
    [
        # 아시아
        [100, 200, 300],
        [400, 500, 600],
        [700, 800, 900]
    ],
    [
        # 동유럽
        [90, 80, 50],
        [80, 80, 40],
        [100, 80, 90]
    ],
    [
        # 북유럽
        [190, 230, 80],
        [150, 130, 100],
        [270, 320, 7]
    ]
])
print(c_values) # 똑같이 나옴

#---------------------------------------------------------------------------------------

""" 전체적인 모양(차원) """
# 배열이 몇 행, 몇 열로 구성되어 있는지 튜플 형태로 보여줌
print(a_values.shape) # (5,)
print(b_values.shape) # (3, 4)
print(c_values.shape) # (3, 3, 3)

""" 요소(값) 하나가 차지하는 메모리 크기(byte) """
print(a_values.itemsize) # 8
print(b_values.itemsize) # 8
print(c_values.itemsize) # 8

""" 전체 요소의 개수 """
print(a_values.size) # 5
print(b_values.size) # 12
print(c_values.size) # 27

#---------------------------------------------------------------------------------------

""" 특정 값으로 채워진 배열을 생성하는 함수 """
# np.zeros : 0으로 구성된 n차원 배열 생성
# np.ones : 1로 구성된 n차원 배열 생성
# np.empty : 초기화 되지 않은 n차원 배열 생성

print(np.zeros((4, 6))) # [[0. 0. 0. 0. 0. 0.]
                        #  [0. 0. 0. 0. 0. 0.]
                        #  [0. 0. 0. 0. 0. 0.]
                        #  [0. 0. 0. 0. 0. 0.]]

print(np.ones((2, 3, 4), dtype = np.int64)) # [[[1 1 1 1]
                                            #   [1 1 1 1]
                                            #   [1 1 1 1]]

                                            #  [[1 1 1 1]
                                            #   [1 1 1 1]
                                            #   [1 1 1 1]]]

print(np.empty((2, 3))) # [[6.95254784e-310 6.95254784e-310 6.95254784e-310]
                        #  [6.95254783e-310 6.95254784e-310 6.95254783e-310]]

#--------------------------------------------------------------------------------------- 

""" arange()와 linspace() """
print(np.arange(10, 30, 5)) # [10 15 20 25] : 10부터 29까지 5 간격으로
print(np.arange(0, 2, 0.3)) # [0.  0.3 0.6 0.9 1.2 1.5 1.8] : 0부터 1까지 0.3 간격으로

print(np.linspace(0, 99, 100)) # 0부터 99까지 list로 출력됨
# np.linspace(a, b, c) : a부터 b까지 c등분

print(np.arange(0, 1+0.25, 0.25)) # [0.   0.25 0.5  0.75 1.  ]
# 1+0.25는 곧 1.25와 같지만, 정수와 실수를 구분하기 위해 이렇게 코드를 짜기도 한다

print(np.linspace(0, 1, 5)) # [0.   0.25 0.5  0.75 1.  ]

#---------------------------------------------------------------------------------------

# 1차원
a = np.arange(6)
print(a) # [0 1 2 3 4 5]

# .reshape() : 1차원을 n차원으로 바꾼다
b = np.arange(12).reshape(4, 3)
print(b)

c = np.arange(24).reshape(2,3,4)
print(c)

#---------------------------------------------------------------------------------------

""" 같은 열끼리 연산을 해서 빼려면? """
a = np.array([20, 30, 40, 50])
b = np.arange(4)
c = a - b
print(c) # [20, 29, 38, 47]

""" 셀의 모든 요소에 *10을 하려면? """
print(b * 10) # [ 0 10 20 30]

""" 모든 요소의 조건 충족 여부 """
print(a < 35) # [ True  True False False]

""" 같은 위치의 데이터끼리 연산 """
A = np.array([
    [1, 1],
    [0, 1]
])

B = np.array([
    [2, 0],
    [3, 4]
])
print(A * B) # [[2 0]
             #  [0 4]]
print(A @ B) # [[5 4]                => 행렬 곱셈
             #  [3 4]]

# int < float    ==    정수와 실수가 묶이면 실수로 변한다

#---------------------------------------------------------------------------------------

# .sum() : 모든 요소의 합
# .min() : 최솟값
# .max() : 최댓값
# .argmax : 최댓값의 index
# .cumsum : 모든 요소의 누적합

a = np.arange(8).reshape(2, 4)**2 # 모든 요소에 **2
print(a) # [[ 0  1  4  9]
         #  [16 25 36 49]]

print(a.sum()) # 140
print(a.min()) # 0
print(a.max()) # 49
print(a.argmax()) # 7
print(a.cumsum()) # [  0   1   5  14  30  55  91 140]

#---------------------------------------------------------------------------------------

# 축 기준
# axis = 0 : 열 기준, axis = 1 : 행 기준

# 열 기준으로 행의 총합
b = np.arange(12).reshape(3, 4)
print(b.sum()) 
print(b.sum(axis = 1)) # [ 6 22 38]

""" 인덱싱 슬라이싱 """
a = np.arange(10)**2 # [ 0  1  4  9 16 25 36 49 64 81]

print(a[2]) # 4
print(a[2:5]) # [ 4  9 16]
print(a[0:6:2]) # [ 0  4 16]

a = np.arange(8)**2 # [ 0  1  4  9 16 25 36 49]
i = np.array([1, 3, 3, 5])
print(a[i]) # [ 1  9  9 25]
# a의 i번 요소

j = np.array([[3, 4], [5, 6]])
print(a[j]) # [[ 9 16]
            #  [25 36]]

#---------------------------------------------------------------------------------------

""" 차원 변경 """
# 1차원을 n차원으로 변환 : .reshape
# n차원을 1차원으로 변환 : .ravel
# 전치 변환 : .T        ex) 3행 4열 -> 4행 3열

a = np.arange(12).reshape(3, 4) # [[[ 0  1  2  3]
                                #   [ 4  5  6  7]
                                #   [ 8  9 10 11]]
print(a.shape) # (3, 4)
    # .ravel()을 사용해서 2차원을 1차원으로 변환
print(a.ravel()) # [ 0  1  2  3  4  5  6  7  8  9 10 11]
print(a.reshape(2, 6)) # [[ 0  1  2  3  4  5]
                       #  [ 6  7  8  9 10 11]]
print(a.T) # [[ 0  4  8]
           #  [ 1  5  9]
           #  [ 2  6 10]
           #  [ 3  7 11]]

#---------------------------------------------------------------------------------------

""" 배열 쪼개기 """
# np.hsplit : 숫자 1개가 들어가면 x개로 등분, 리스트를 넣을 경우 x 기준으로 데이터 분할

a = np.arange(12).reshape(2, 6)
    # a를 3등분해라
print(np.hsplit(a, 3)) # 0, 1, 6, 7  /  2, 3, 8, 9  /  4, 5, 10, 11
# list 안에 여러 개의 배열(array)가 담긴 형태이기 때문에 print했을 때 array가 함께 출력됨

""" 지점 분할 """
# 3번 인덱스 앞과 4번 인덱스 앞에서 칼질하기 -?????
print(np.hsplit(a, (3, 4)))

""" 배열 쌓기 """
# np.vstack : axis = 0 (열)
# np.hstack : axis = 1 (행)

a = np.array([1, 2, 3, 4]).reshape(2, 2)
b = np.array([5, 6, 7, 8]).reshape(2, 2)
# 세로로 쌓기
print(np.vstack((a, b))) # [[1 2]
                         #  [3 4]
                         #  [5 6]
                         #  [7 8]]
# 가로로 쌓기
print(np.hstack((a, b))) # [[1 2 5 6]
                         #  [3 4 7 8]]