""" NUMPY """
# 선형대수 연산에 필요한 디자인 배열과 배열 연산을 수행하는 다양한 함수 제공

#---------------------------------------------------------------------------------------

import numpy as np

# 1. 넘파이 배열
# 파이썬의 list와 비슷해 보이지만 계산 속도가 훨씬 빠르다

""" 1차원 """
a_values = np.array([12500, 45000, 32000, 0, 56000])
print(a_values) # [12500 45000 32000     0 56000]

""" 2차원 """
b_values = np.array([
    [1000, 2000, 3000, 4000],
    [5000, 6000, 7000, 8000],
    [9000, 10000, 11000, 12000],
])
print(b_values) # [[ 1000  2000  3000  4000]
                #  [ 5000  6000  7000  8000]
                #  [ 9000 10000 11000 12000]]

""" 3차원 """
c_values = np.array([
    [
        # 아시아
        [100, 200, 300],
        [400, 500, 600],
        [700, 800, 900]
    ],
    [
        # 동유럽
        [90, 80, 50],
        [80, 80, 40],
        [100, 80, 90]
    ],
    [
        # 북유럽
        [190, 230, 80],
        [150, 130, 100],
        [270, 320, 7]
    ]
])
print(c_values) # 똑같이 나옴

#---------------------------------------------------------------------------------------

""" 전체적인 모양(차원) """
# 배열이 몇 행, 몇 열로 구성되어 있는지 튜플 형태로 보여줌
print(a_values.shape) # (5,)
print(b_values.shape) # (3, 4)
print(c_values.shape) # (3, 3, 3)

""" 요소(값) 하나가 차지하는 메모리 크기(byte) """
print(a_values.itemsize) # 8
print(b_values.itemsize) # 8
print(c_values.itemsize) # 8

""" 전체 요소의 개수 """
print(a_values.size) # 5
print(b_values.size) # 12
print(c_values.size) # 27

#---------------------------------------------------------------------------------------

""" 특정 값으로 채워진 배열을 생성하는 함수 """
# np.zeros : 0으로 구성된 n차원 배열 생성
# np.ones : 1로 구성된 n차원 배열 생성
# np.empty : 초기화 되지 않은 n차원 배열 생성

print(np.zeros((4, 6))) # [[0. 0. 0. 0. 0. 0.]
                        #  [0. 0. 0. 0. 0. 0.]
                        #  [0. 0. 0. 0. 0. 0.]
                        #  [0. 0. 0. 0. 0. 0.]]

print(np.ones((2, 3, 4), dtype = np.int64)) # [[[1 1 1 1]
                                            #   [1 1 1 1]
                                            #   [1 1 1 1]]

                                            #  [[1 1 1 1]
                                            #   [1 1 1 1]
                                            #   [1 1 1 1]]]

print(np.empty((2, 3))) # [[6.95254784e-310 6.95254784e-310 6.95254784e-310]
                        #  [6.95254783e-310 6.95254784e-310 6.95254783e-310]]

#--------------------------------------------------------------------------------------- 

""" arange()와 linspace() """
print(np.arange(10, 30, 5)) # [10 15 20 25] : 10부터 29까지 5 간격으로
print(np.arange(0, 2, 0.3)) # [0.  0.3 0.6 0.9 1.2 1.5 1.8] : 0부터 1까지 0.3 간격으로

print(np.linspace(0, 99, 100)) # 0부터 99까지 list로 출력됨
# np.linspace(a, b, c) : a부터 b까지 c등분

print(np.arange(0, 1+0.25, 0.25)) # [0.   0.25 0.5  0.75 1.  ]
# 1+0.25는 곧 1.25와 같지만, 정수와 실수를 구분하기 위해 이렇게 코드를 짜기도 한다

print(np.linspace(0, 1, 5)) # [0.   0.25 0.5  0.75 1.  ]

#---------------------------------------------------------------------------------------

# 1차원
a = np.arange(6)
print(a) # [0 1 2 3 4 5]

# .reshape() : 1차원을 n차원으로 바꾼다
b = np.arange(12).reshape(4, 3)
print(b)

c = np.arange(24).reshape(2,3,4)
print(c)

#---------------------------------------------------------------------------------------

""" 같은 열끼리 연산을 해서 빼려면? """
a = np.array([20, 30, 40, 50])
b = np.arange(4)
c = a - b
print(c) # [20, 29, 38, 47]

""" 셀의 모든 요소에 *10을 하려면? """
print(b * 10) # [ 0 10 20 30]

""" 모든 요소의 조건 충족 여부 """
print(a < 35) # [ True  True False False]

""" 같은 위치의 데이터끼리 연산 """
A = np.array([
    [1, 1],
    [0, 1]
])

B = np.array([
    [2, 0],
    [3, 4]
])
print(A * B) # [[2 0]
             #  [0 4]]
print(A @ B) # [[5 4]                => 행렬 곱셈
             #  [3 4]]

# int < float    ==    정수와 실수가 묶이면 실수로 변한다