# import streamlit as st
import pandas as pd
import numpy as np

print("-------------- 과제 2 : 데이터 클렌징 --------------")
# 파일을 읽고, cp949 인코딩
trade_data = pd.read_csv("raw_trade_data.csv", encoding = "cp949")
print(trade_data)

#---------------------------------------------------------------------------------------

# '중량' 컬럼에 결측치가 있다면 해당 품목의 평균 중량으로 채우기
""" 1. 품목(HS CODE)별 중량 평균 구하기 """
hs_mean = trade_data.groupby("hs_code")["중량"].mean() # hs_code로 group을 잡고, 중량의 평균을 내줘

""" 2. 결측치를 찾아서 해당하는 group의 중량 평균으로 채우기 """
for hs in hs_mean.index: # index : 딕셔너리의 value값만 가지고 오는 것
    # 1. 현재 순서의 HS CODE에 해당하는 평균값 가져오기
    avg_val = hs_mean[hs]
    # 2. 원본 데이터에서 해당 HS CODE이면서 중량이 비어있는 행만 찾기
    target = (trade_data["hs_code"] == hs) & (trade_data["중량"].isna())
    # 3. 해당되는 칸에만 평균값을 대입
    trade_data.loc[target, "중량"] = avg_val

    # 만약 해당 HS CODE의 평균 중량이 아니라 0으로 채우고 싶다면?
# trade_data.loc[trade_data["중량"].isna()] = 0

#---------------------------------------------------------------------------------------

# '수출입구분' 컬럼의 데이터가 영문(Import, Export)으로 되어 있다면 국문(수입, 수출)으로 일괄 변경하기
trade_data.loc[trade_data["수출입구분"] == "Export", "수출입구분"] = "수출"
trade_data.loc[trade_data["수출입구분"] == "Import", "수출입구분"] = "수입"

#---------------------------------------------------------------------------------------

# 현재 '수출금액' 단위 '원'을 '백만 달러' 단위로 변환한 수출금액_M_USD 컬럼 만들기 (환율 1,470원 가정)
# 금액 ÷ 1470 ÷ 1000000
exchange_rate = 1470
trade_data["수출금액_M_USD"] = (trade_data["수출금액"]/exchange_rate)/1000000

#---------------------------------------------------------------------------------------

# 변경 후 데이터의 각 컬럼별 데이터 타입(df.dtypes)을 확인하여 수치형 데이터가 맞는지 검증
print("\n ---------- [최종 데이터 확인] ----------")
print(trade_data.dtypes)

print("\n ---------- [클렌징 결과 샘플 확인] ----------")
print(trade_data[["날짜", "hs_code", "수출입구분", "중량", "수출금액_M_USD"]].head(10))

# 최종 결과 csv 파일로 저장
trade_data.to_csv("./clean_trade_data.csv", index = False)
print("과제 완료✌️👁️👄👁️✌️")